"""
Даны 2 действительных числа a и b. Получить их сумму, разность и
произведение.
"""

a = 5
b = 8
sum = a+b
print(f"Сумма равна: {sum}")
diff = a-b
print(f"Разность равна: {diff}")
mult = a*b
print(f"Произведение равно:  {mult}")
