"""
Дана длина ребра куба. Найти объем куба и площадь его боковой
поверхности.
"""

a = 6

v = a**3
s = (a**2)*6
print(f"Объем куба равен: {v}")
print(f"Площадь боковой поверхности равна : {s}")